<?php
$counter = isset($_COOKIE['counter']) ? $_COOKIE['counter']:0;
$counter++;
setcookie("counter", $counter);
echo counter;
session_start();
?>


<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <!--    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />-->
    <!--    <meta http-equiv="content-type" content="text/html; charset=windows-1251" />-->
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
</head>
<body>
<?php

# ??? вместо русских букв - исправить кодировку в PHP STORM:
# File -> Settings -> File encoging -> Project encoding -> изменить на UTF-8

#=======================================================================================================================
echo "<br>";#                                               Переменные
#=======================================================================================================================
$MY_VAR = 5;
$MY_VAR2 = 'world';
$MY_VAR3 = -15;
print gettype($MY_VAR); #получить тип переменной (integer, double, string, array, object, ресурс, boolean, null, collable)
if (isset($MY_VAR)){print 'Переменная существует';} # проверка на существование переменной
unset($MY_VAR);# уничтожить переменную

define('pipi', 3.14); # определение глобальной переменной ИМЯ и ЗНАЧЕНИЕ
$MY_ARRAY = array('a'=>5, 'b'=>3); # аналог словаря в питоне
$len = count($MY_ARRAY); # количество элементов в массиве
print_r($MY_ARRAY); # функция формирует отладочное представление в виде строки. медленнее чем echo и print. echo быстрее, чем print
echo "Hello $MY_VAR2"; #Hello world
echo $MY_VAR2[0]; # w
$MY_VAR3 = $MY_VAR3 < 0? -$MY_VAR3 : $MY_VAR3; # если $MY_VAR меньше 0, сменить знак, если больше, то без изменений
echo $MY_VAR3.'<br>';

foreach ($_SERVER as $k=>$v){echo "<b>$k</b> - <b>$v</b><br>";} # $k => $v ключ и значение

#=======================================================================================================================
echo "<br>";#                                               Массивы
#=======================================================================================================================
$name['ivanov'] = 'roman';
$name['petrov'] = 'fedor';
echo $name['petrov']; # fedor

# глобальный ассоциативный массив
define('fullinfo', ['manager' => ['name'=>'ivan', 'born'=>'2010-11-05']]);
echo fullinfo['manager']['name']; # ivan
#---- /\/\ ----#

require 'header.php';# интерпретатор заменит инструкцию содержимым файла
require_once 'header.php';# подтягивает файл только 1 раз, потом будет пропускать. предпочтительна это инструкция

function myFunc(){
    # название функции регистронезависимо
    # 20-30 строк для функции - норм, лучше несколько коротких, чем 1-2 огромных
    static $count=0; # объявление статической переменной, значение которой будет сохраняться после кажд.вызова;
}

#=======================================================================================================================
echo "<br>";#                                               Формы
#=======================================================================================================================
# https://www.youtube.com/watch?v=r_ivKeBLZjE&list=PLVfMKQXDAhGWCBTca7m-snWrZZkjX2jGB&index=8
echo '<form action="" method="post">';
echo '<p>Ваше имя <input type="text" name="name"/></p>';
echo '<p>Ваш возраст <input type="text" name="age"/></p>';
echo '<p><input type="submit"/></p>';
echo '</form>';
### посмотреть варианты input'ов: https://www.w3schools.com/html/html_forms.asp

#=======================================================================================================================
echo "<br>";#                                               $_POST
#=======================================================================================================================
echo 'Привет '.htmlspecialchars($_POST['name']);
echo 'Вам '.htmlspecialchars($_POST['name']).' лет.';
print_r($_POST);
# $_POST - Array ( [name] => sefsef [age] => 12 )
# $_REQUEST - переменная, источник у которой не имеет значения: $_GET, $_POST, COOKIES...
# $_GET - передает инфу в части адресной строки

#=======================================================================================================================
echo "<br>";#                                               $_COOKIE
#=======================================================================================================================
#COOKIE всегда сверху страницы

#=======================================================================================================================
echo "<br>";#                                               $_SESSION
#=======================================================================================================================
#SESSION всегда сверху страницы
$_SESSION["favoutitecolour"] = "blue";
$_SESSION["favouritepage"] = "home";
echo $_SESSION["favoutitecolour"];
echo $_SESSION["favouritepage"];

#=======================================================================================================================
echo "<br>";#                                               date() & time() & strftime()
#=======================================================================================================================
date_default_timezone_set("Europe/Moscow");#установка часового пояса
echo date("Today d.m.Y");#MSK201912pm19 12.11.2019
echo "<br>";
echo (time()); #1573558928 - количество секунд с эпохи unix
echo "<br>";

setlocale(LC_ALL, '');
echo strftime("%B %Y года. %A, %H:%M");
echo strftime(" по-немецки - %A.\n");

$time2 = strtotime("-1 day");
$yesterday = date("d.m.Y", $time2); #11.11.2019

#=======================================================================================================================
echo "<br>";#                                               файлы
#=======================================================================================================================


?>
</body>
</html>
